In [ ]:
import pandas as pd
import numpy as np

In [3]:
df =pd.read_csv("cc_info.csv")
df

          credit_card        city state  zipcode  credit_card_limit
0    1280981422329509      Dallas    PA    18612               6000
1    9737219864179988     Houston    PA    15342              16000
2    4749889059323202      Auburn    MA     1501              14000
3    9591503562024072     Orlando    WV    26412              18000
4    2095640259001271    New York    NY    10001              20000
..                ...         ...   ...      ...                ...
979  8938296722055540     Houston    PA    15342              36000
980  2756688131944353  Washington    NH     3280              15000
981  5783648852115715  Washington    NH     3280              20000
982  8259854075192493       Omaha    GA    31821              10000
983  1409322756311484     Houston    PA    15342              15000

[984 rows x 5 columns]

In [4]:
df.columns

Index(['credit_card', 'city', 'state', 'zipcode', 'credit_card_limit'], dtype='object')

In [6]:
df.shape

(984, 5)

In [7]:
df.describe()

        credit_card       zipcode  credit_card_limit
count  9.840000e+02    984.000000         984.000000
mean   5.410432e+15  17895.316057       12321.138211
std    2.545234e+15  23778.651105        7398.449174
min    1.003715e+15    690.000000        2000.000000
25%    3.316062e+15   3280.000000        7000.000000
50%    5.365218e+15   5820.000000       10000.000000
75%    7.562153e+15  18101.250000       16000.000000
max    9.999757e+15  98401.000000       55000.000000

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 984 entries, 0 to 983
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   credit_card        984 non-null    int64
 1   city               984 non-null    object
 2   state              984 non-null    object
 3   zipcode            984 non-null    int64
 4   credit_card_limit  984 non-null    int64
dtypes: int64(3), object(2)
memory usage: 38.6+ KB

In [9]:
df.isnull().sum().sum()

np.int64(0)

In [10]:
df.duplicated().sum()

np.int64(0)

In [11]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [12]:
df['city']=le.fit_transform(df['city'])
df['state']=le.fit_transform(df['state'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 984 entries, 0 to 983
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   credit_card        984 non-null    int64
 1   city               984 non-null    int64
 2   state              984 non-null    int64
 3   zipcode            984 non-null    int64
 4   credit_card_limit  984 non-null    int64
dtypes: int64(5)
memory usage: 38.6 KB

In [13]:
df

          credit_card  city  state  zipcode  credit_card_limit
0    1280981422329509    29     26    18612               6000
1    9737219864179988    50     26    15342              16000
2    4749889059323202     6     14     1501              14000
3    9591503562024072    84     34    26412              18000
4    2095640259001271    78     23    10001              20000
..                ...   ...    ...      ...                ...
979  8938296722055540    50     26    15342              36000
980  2756688131944353   119     20     3280              15000
981  5783648852115715   119     20     3280              20000
982  8259854075192493    83      6    31821              10000
983  1409322756311484    50     26    15342              15000

[984 rows x 5 columns]

In [14]:
from sklearn.cluster import KMeans
x=df[['credit_card','credit_card_limit']]

In [15]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x=sc.fit_transform(df)

In [16]:
x=pd.DataFrame(df)
x.head()

        credit_card  city  state  zipcode  credit_card_limit
0  1280981422329509    29     26    18612               6000
1  9737219864179988    50     26    15342              16000
2  4749889059323202     6     14     1501              14000
3  9591503562024072    84     34    26412              18000
4  2095640259001271    78     23    10001              20000